<a id="1"></a>

# <p style="padding: 10px; background-color: orange; margin: 10px; color: #000000; font-family: newtimeroman; font-size: 100%; text-align: center; border-radius: 10px; overflow: hidden; font-weight: 50;">Advance Pandas Assignment </p>

<a id="1"></a>
# <p style="padding: 10px; background-color: yellow; margin: 5px; color: #000000; font-family: newtimeroman; font-size: 60%; text-align: right; border-radius: 5px; overflow: hidden; font-weight: 50;">RUSHI BHAMARE</p>

## Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

**1. read_csv()**: Used to read data from a CSV file into a pandas DataFrame.

In [2]:
df = pd.read_csv('https://media.githubusercontent.com/media/datablist/sample-csv-files/main/files/organizations/organizations-100.csv')
print(df)

    Index  Organization Id                     Name  \
0       1  FAB0d41d5b5d22c              Ferrell LLC
1       2  6A7EdDEA9FaDC52  Mckinney, Riley and Day
2       3  0bFED1ADAE4bcC1               Hester Ltd
3       4  2bFC1Be8a4ce42f           Holder-Sellers
4       5  9eE8A6a4Eb96C24              Mayer Group
..    ...              ...                      ...
95     96  0a0bfFbBbB8eC7c             Holmes Group
96     97  BA6Cd9Dae2Efd62                 Good Ltd
97     98  E7df80C60Abd7f9        Clements-Espinoza
98     99  AFc285dbE2fEd24               Mendez Inc
99    100  e9eB5A60Cef8354           Watkins-Kaiser

                           Website                      Country  \
0               https://price.net/             Papua New Guinea
1   http://www.hall-buchanan.info/                      Finland
2        http://sullivan-reed.com/                        China
3              https://becker.com/                 Turkmenistan
4           http://www.brewer.com/                    Mauritius
..                             ...                          ...
95           https://mcdowell.org/                     Ethiopia
96               http://duffy.com/                     Anguilla
97         http://www.flowers.net/  Falkland Islands (Malvinas)
98          https://www.burke.net/              Kyrgyz Republic
99         http://www.herring.com/                         Togo

                                       Description  Founded  \
0              Horizontal empowering knowledgebase     1990
1              User-centric system-worthy leverage     2015
2                   Switchable scalable moratorium     1971
3   De-engineered systemic artificial intelligence     2004
4               Synchronized needs-based challenge     1991
..                                             ...      ...
95          Right-sized zero tolerance focus group     1975
96         Reverse-engineered composite moratorium     1971
97                         Progressive modular hub     1991
98                 User-friendly exuding migration     1993
99                   Synergistic background access     2009

                       Industry  Number of employees
0                      Plastics                 3498
1   Glass / Ceramics / Concrete                 4952
2                 Public Safety                 5287
3                    Automotive                  921
4                Transportation                 7870
..                          ...                  ...
95                  Photography                 2988
96            Consumer Services                 4292
97              Broadcast Media                  236
98         Education Management                  339
99           Financial Services                 2785

[100 rows x 9 columns]

**2. head()**: Displays the first few rows (default is 5) of a DataFrame to quickly inspect the data.

In [3]:
df.head(3)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,5287

**3. describe()**: Provides summary statistics of numerical columns in the DataFrame.

In [4]:
df.describe()

            Index      Founded  Number of employees
count  100.000000   100.000000           100.000000
mean    50.500000  1995.410000          4964.860000
std     29.011492    15.744228          2850.859799
min      1.000000  1970.000000           236.000000
25%     25.750000  1983.500000          2741.250000
50%     50.500000  1995.000000          4941.500000
75%     75.250000  2010.250000          7558.000000
max    100.000000  2021.000000          9995.000000

**4. groupby()**: Used for grouping and aggregating data based on one or more columns.

In [5]:
grouped = df.groupby('Name')['Number of employees'].mean()
print(grouped)

Name
Arroyo Inc                       9067.0
Ayala LLC                        7664.0
Baker, Mccann and Macdonald      1638.0
Bartlett-Arroyo                  3987.0
Beasley, Greene and Mahoney       869.0
                                  ...
Walls LLC                        1678.0
Walton-Barnett                   1746.0
Watkins-Kaiser                   2785.0
Weiss and Sons                   5984.0
Wilkinson, Charles and Arroyo     602.0
Name: Number of employees, Length: 100, dtype: float64

**5. drop()**: Used to remove specified rows or columns from a DataFrame.

In [6]:
# Drop Website

In [7]:
drop_web = df.drop('Website',axis = 1)

In [8]:
drop_web

,Index,Organization Id,Name,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952
2,3,0bFED1ADAE4bcC1,Hester Ltd,China,Switchable scalable moratorium,1971,Public Safety,5287
3,4,2bFC1Be8a4ce42f,Holder-Sellers,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,921
4,5,9eE8A6a4Eb96C24,Mayer Group,Mauritius,Synchronized needs-based challenge,1991,Transportation,7870
...,...,...,...,...,...,...,...,...
95,96,0a0bfFbBbB8eC7c,Holmes Group,Ethiopia,Right-sized zero tolerance focus group,1975,Photography,2988
96,97,BA6Cd9Dae2Efd62,Good Ltd,Anguilla,Reverse-engineered composite moratorium,1971,Consumer Services,4292
97,98,E7df80C60Abd7f9,Clements-Espinoza,Falkland Islands (Malvinas),Progressive modular hub,1991,Broadcast Media,236
98,99,AFc285dbE2fEd24,Mendez Inc,Kyrgyz Republic,User-friendly exuding migration,1993,Education Management,339
99,100,e9eB5A60Cef8354,Watkins-Kaiser,Togo,Synergistic background access,2009,Financial Services,2785

****

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
import pandas as pd

def reindex_with_custom_increment(df):
    # Reset the existing index
    df = df.reset_index(drop=True)
    
    # Create a new index starting from 1 and incrementing by 2
    new_index = pd.RangeIndex(start=1, stop=2 * len(df), step=2)
    
    df.index = new_index
    
    return df

# Example DataFrame 'df' with columns 'A', 'B', and 'C'
data = {'A': [10, 20, 30],
        'B': [40, 50, 60],
        'C': [70, 80, 90]}

df = pd.DataFrame(data)

new_df = reindex_with_custom_increment(df)

print(new_df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

****

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [10]:
import pandas as pd

def calculate_sum_of_first_three_values(df):
    
    if 'Values' in df.columns:
       
        first_three_values_sum = df['Values'].iloc[:3].sum()
        
        # Print the sum to the console
        print("Sum of the first three values:", first_three_values_sum)
    else:
        print("DataFrame does not have a 'Values' column.")

# Example DataFrame 'df' with a 'Values' column
data = {'Values': [10, 20, 30, 40, 50]}

df = pd.DataFrame(data)

calculate_sum_of_first_three_values(df)

Sum of the first three values: 60

*******

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
import pandas as pd

def add_word_count_column(df):
    # Create a new column 'Word_Count' by applying a lambda function to count words in each row
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    
    return df

data = {'Text': ["This is a sample sentence.", "Let's do it now.", "No more excuses."]}
df = pd.DataFrame(data)
add_word_count_column(df)

                         Text  Word_Count
0  This is a sample sentence.           5
1            Let's do it now.           4
2            No more excuses.           3

****

## Q5. How are DataFrame.size() and DataFrame.shape() different?

#### DataFrame.shape:

#### DataFrame.shape is an attribute that returns a tuple representing the dimensions of the DataFrame.
#### It provides information about the number of rows and columns in the DataFrame.
#### The tuple returned has two elements: (number_of_rows, number_of_columns).
#### For example, if you have a DataFrame called df, you can use df.shape to get the dimensions like this:

In [17]:
rows, columns = df.shape

In [18]:
rows, columns

(3, 2)

#### DataFrame.size:

#### DataFrame.size is an attribute that returns the total number of elements in the DataFrame.
#### It calculates the size by multiplying the number of rows by the number of columns.
#### It represents the total number of cells in the DataFrame, including all the values and empty cells.
#### For example, if you have a DataFrame called df, you can use df.size to get the total number of elements.

In [19]:
df.size

6

****

## Q6. Which function of pandas do we use to read an excel file?

import pandas as pd

df = pd.read_excel('your_excel_file.xlsx')

In [21]:
import pandas as pd

df = pd.read_excel('plant_data.xlsx')

In [22]:
df

    Sr. No.       Plant                                      Plant Address
0         1     Plant I  Plot No. 133, Sector-24, Faridabad-121005, Har...
1         2    Plant II  71-72, MIDC, Satpur, Nashik - 422007, Maharashtra
2         3   Plant III  Plot No. B-2, Survey No.1, Tata Motors Vendor ...
3         4    Plant IV  Plot No. 118, Sector-59, HSIIDC, Industrial Es...
4         5     Plant V  A-4, Industrial Estate, Kosi Kalan - 281403, D...
5         6    Plant VI  Plot No. 157-E, Sector-3, Pithampur Industrial...
6         7   Plant VII  Plot No. SP-891, Pathredi Industrial Area, Bhi...
7         8  Plant VIII  Plot No. 80, Sector-3, Pithampur industrial Ar...
8         9    Plant IX  C-1/2, MIDC, Chakan Telegaon road, Chakan, Pun...
9        10     Plant X  A-1/6, MVML Vendor Park, Chakan, Pune-410501, ...
10       11    Plant XI  Plot no 1, Ford Suppliers Park, S.P.Koil post,...
11       12   Plant XII  RNS 1, Renault- Nissan Suppliers Park, Orgadam...
12       13  Plant XIII  Plot No. AV-13, Ford Supplier Park, BOL, Indus...

****

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [39]:
import pandas as pd


data = {'Email': ['bhamarerushi@gmail.com', 'bhamareaksh@gmail.com', 'rahulp67@gmail.com','vaibh23@gmail.com','rahul233455@gmail.com']}
df = pd.DataFrame(data)

def extract_username(email):
    return email.split('@')[0]

df['Username'] = df['Email'].apply(extract_username)

In [40]:
df

                    Email      Username
0  bhamarerushi@gmail.com  bhamarerushi
1   bhamareaksh@gmail.com   bhamareaksh
2      rahulp67@gmail.com      rahulp67
3       vaibh23@gmail.com       vaibh23
4   rahul233455@gmail.com   rahul233455

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [43]:
import pandas as pd

data = {'A': [3, 7, 2, 8, 6, 7, 8],
        'B': [9, 5, 4, 3, 12, 13, 14],
        'C': [15, 8, 7, 2, 10, 21, 13]}
df = pd.DataFrame(data)

def condition_1(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

select_rows = condition_1(df)

In [44]:
select_rows

   A  B  C
1  7  5  8
3  8  3  2

*****

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [47]:
data = {'Values': [10, 15, 20, 25, 30, 34, 38, 43, 44, 50, 58, 61]}
df = pd.DataFrame(data)

# Function to calculate mean, median, and standard deviation
def calculate_stats(df):
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_deviation = df['Values'].std()
    
    return mean_value, median_value, std_deviation

In [49]:
mean, median, std_dev = calculate_stats(df)

In [50]:
mean, median, std_dev

(35.666666666666664, 36.0, 16.389205612416383)

In [52]:
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std_dev)

Mean: 35.666666666666664
Median: 36.0
Standard Deviation: 16.389205612416383

****

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [63]:
import pandas as pd

# Sample DataFrame
data = {'Date': pd.date_range(start='2023-09-11', periods=10, freq='D'),
        'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]}
df = pd.DataFrame(data)

# Function to calculate the moving average
def calculate_moving_average(df, window_size=7):
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean()
    return df

df = calculate_moving_average(df)

In [64]:
df

        Date  Sales  MovingAverage
0 2023-09-11     10           10.0
1 2023-09-12     15           12.5
2 2023-09-13     20           15.0
3 2023-09-14     25           17.5
4 2023-09-15     30           20.0
5 2023-09-16     35           22.5
6 2023-09-17     40           25.0
7 2023-09-18     45           30.0
8 2023-09-19     50           35.0
9 2023-09-20     55           40.0

*****

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [66]:
import pandas as pd

data = {'Date': pd.date_range(start='2023-09-11', periods=20, freq='D')}
df = pd.DataFrame(data)

def weekday_column(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

# Call the function to create the 'Weekday' column
df = weekday_column(df)

In [67]:
df

         Date    Weekday
0  2023-09-11     Monday
1  2023-09-12    Tuesday
2  2023-09-13  Wednesday
3  2023-09-14   Thursday
4  2023-09-15     Friday
5  2023-09-16   Saturday
6  2023-09-17     Sunday
7  2023-09-18     Monday
8  2023-09-19    Tuesday
9  2023-09-20  Wednesday
10 2023-09-21   Thursday
11 2023-09-22     Friday
12 2023-09-23   Saturday
13 2023-09-24     Sunday
14 2023-09-25     Monday
15 2023-09-26    Tuesday
16 2023-09-27  Wednesday
17 2023-09-28   Thursday
18 2023-09-29     Friday
19 2023-09-30   Saturday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [71]:
import pandas as pd

#DataFrame
data = {'Date': pd.date_range(start='2023-01-01', periods=50, freq='D')}
df = pd.DataFrame(data)
def select_rows_in_date_range(df, start_date, end_date):
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df[mask]
    return selected_rows

start_date = '2023-01-01'
end_date = '2023-01-31'

# Call the function
selected_df = select_rows_in_date_range(df, start_date, end_date)

In [72]:
selected_df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

*****

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [74]:
import pandas as pd

#### By convention, Pandas is commonly imported as pd, which allows you to use Pandas functions and classes with the pd prefix in your code. This is the standard practice when working with Pandas in Python.

<a id="1"></a>

# <p style="padding: 10px; background-color: orange; margin: 10px; color: #000000; font-family: newtimeroman; font-size: 100%; text-align: center; border-radius: 10px; overflow: hidden; font-weight: 50;">Thank You </p>